In [1]:
# Import dependencies
import pandas as pd
import os
from sqlalchemy import create_engine

In [8]:
# Bring in CSVs
wwii_data = 'Resources/THOR_WWII_DATA_CLEAN.csv'
weather_stations = 'Resources/weather_stations.csv'
weather = 'Resources/Summary_of_Weather.csv'

In [9]:
#read in first csv to dataframe
wwii_df = pd.read_csv(wwii_data,encoding='latin-1', low_memory=False)
wwii_df.head()

,WWII_ID,MSNDATE,THEATER,NAF,COUNTRY_FLYING_MISSION,TGT_COUNTRY_CODE,TGT_COUNTRY,TGT_LOCATION,TGT_TYPE,TGT_ID,TGT_INDUSTRY_CODE,TGT_INDUSTRY,SOURCE_LATITUDE,SOURCE_LONGITUDE,LATITUDE,LONGITUDE,MDS,AIRCRAFT_NAME
0,45601,9/3/39,ETO,RAF,GREAT BRITAIN,8.0,GERMANY,"""HAMBURG, BREMEN, RUHR""",PROPAGANDA,NaN,NaN,NaN,NaN,NaN,53.563056,9.967222,WHITLEY,WHITLEY
1,45602,9/4/39,ETO,RAF,GREAT BRITAIN,8.0,GERMANY,WILHELMSHAVEN,SHIPS IN HARBOR,NaN,NaN,NaN,NaN,NaN,53.500000,8.050000,BLENHEIM,BLENHEIM
2,45603,9/4/39,ETO,RAF,GREAT BRITAIN,8.0,GERMANY,BRUNSBUTTEL,SHIPS IN HARBOR,NaN,NaN,NaN,NaN,NaN,53.895040,9.104836,WELLINGTON,WELLINGTON
3,45604,9/4/39,ETO,RAF,GREAT BRITAIN,8.0,GERMANY,RUHR,PROPAGANDA,NaN,NaN,NaN,NaN,NaN,52.366667,9.716667,WHITLEY,WHITLEY
4,45605,9/5/39,ETO,RAF,GREAT BRITAIN,8.0,GERMANY,"""MAINZ, DARMSTADT, MANNHEIM, FRANKFURT""",PROPAGANDA,NaN,NaN,NaN,NaN,NaN,48.766667,9.150000,WHITLEY,WHITLEY

In [10]:
#get columns
wwii_df.columns

Index(['WWII_ID', 'MSNDATE', 'THEATER', 'NAF', 'COUNTRY_FLYING_MISSION',
       'TGT_COUNTRY_CODE', 'TGT_COUNTRY', 'TGT_LOCATION', 'TGT_TYPE', 'TGT_ID',
       'TGT_INDUSTRY_CODE', 'TGT_INDUSTRY', 'SOURCE_LATITUDE',
       'SOURCE_LONGITUDE', 'LATITUDE', 'LONGITUDE', 'MDS', 'AIRCRAFT_NAME'],
      dtype='object')

In [11]:
#new df with only columns
wwii_clean = wwii_df[['COUNTRY_FLYING_MISSION', 'TGT_COUNTRY', 'TGT_LOCATION', 'LATITUDE', 'LONGITUDE']].copy()
wwii_clean.head()

,COUNTRY_FLYING_MISSION,TGT_COUNTRY,TGT_LOCATION,LATITUDE,LONGITUDE
0,GREAT BRITAIN,GERMANY,"""HAMBURG, BREMEN, RUHR""",53.563056,9.967222
1,GREAT BRITAIN,GERMANY,WILHELMSHAVEN,53.500000,8.050000
2,GREAT BRITAIN,GERMANY,BRUNSBUTTEL,53.895040,9.104836
3,GREAT BRITAIN,GERMANY,RUHR,52.366667,9.716667
4,GREAT BRITAIN,GERMANY,"""MAINZ, DARMSTADT, MANNHEIM, FRANKFURT""",48.766667,9.150000

In [12]:
#read in weather station data
stations_df = pd.read_csv(weather_stations,encoding='latin-1', low_memory=False)
stations_df.head()

   Unnamed: 0   WBAN            NAME STATE/COUNTRY ID   Latitude  Longitude
0           0  33013          AIN EL               AL  36.383333   6.650000
1           1  33031        LA SENIA               AL  35.616667   0.583333
2           2  33023  MAISON BLANCHE               AL  36.716667   3.216667
3           3  33044        TELERGMA               AL  36.116667   6.416667
4           4  12001         TINDOUF               AL  27.683333  -8.083333

In [7]:
stations_clean = stations_df[['WBAN', 'NAME', 'STATE/COUNTRY ID', 'Latitude', 'Longitude']].copy()
stations_clean.head()

    WBAN            NAME STATE/COUNTRY ID   Latitude  Longitude
0  33013          AIN EL               AL  36.383333   6.650000
1  33031        LA SENIA               AL  35.616667   0.583333
2  33023  MAISON BLANCHE               AL  36.716667   3.216667
3  33044        TELERGMA               AL  36.116667   6.416667
4  12001         TINDOUF               AL  27.683333  -8.083333

In [8]:
# read in weather data
weather_df = pd.read_csv(weather,encoding='latin-1', low_memory=False)
weather_df.head()

,STA,Date,Precip,WindGustSpd,MaxTemp,MinTemp,MeanTemp,Snowfall,PoorWeather,YR,...,FB,FTI,ITH,PGT,TSHDSBRSGF,SD3,RHX,RHN,RVG,WTE
0,10001,1942-7-1,1.016,NaN,25.555556,22.222222,23.888889,0,NaN,42,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,10001,1942-7-2,0,NaN,28.888889,21.666667,25.555556,0,NaN,42,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,10001,1942-7-3,2.54,NaN,26.111111,22.222222,24.444444,0,NaN,42,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,10001,1942-7-4,2.54,NaN,26.666667,22.222222,24.444444,0,NaN,42,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,10001,1942-7-5,0,NaN,26.666667,21.666667,24.444444,0,NaN,42,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
#get column names
weather_df.columns

Index(['STA', 'Date', 'Precip', 'WindGustSpd', 'MaxTemp', 'MinTemp',
       'MeanTemp', 'Snowfall', 'PoorWeather', 'YR', 'MO', 'DA', 'PRCP', 'DR',
       'SPD', 'MAX', 'MIN', 'MEA', 'SNF', 'SND', 'FT', 'FB', 'FTI', 'ITH',
       'PGT', 'TSHDSBRSGF', 'SD3', 'RHX', 'RHN', 'RVG', 'WTE'],
      dtype='object')

In [10]:
weather_clean = weather_df[['STA']].copy()
weather_clean.head()

     STA
0  10001
1  10001
2  10001
3  10001
4  10001

In [11]:
weather_df

,STA,Date,Precip,WindGustSpd,MaxTemp,MinTemp,MeanTemp,Snowfall,PoorWeather,YR,...,FB,FTI,ITH,PGT,TSHDSBRSGF,SD3,RHX,RHN,RVG,WTE
0,10001,1942-7-1,1.016,NaN,25.555556,22.222222,23.888889,0,NaN,42,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,10001,1942-7-2,0,NaN,28.888889,21.666667,25.555556,0,NaN,42,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,10001,1942-7-3,2.54,NaN,26.111111,22.222222,24.444444,0,NaN,42,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,10001,1942-7-4,2.54,NaN,26.666667,22.222222,24.444444,0,NaN,42,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,10001,1942-7-5,0,NaN,26.666667,21.666667,24.444444,0,NaN,42,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119035,82506,1945-12-27,0,NaN,28.333333,18.333333,23.333333,0,NaN,45,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119036,82506,1945-12-28,9.906,NaN,29.444444,18.333333,23.888889,0,1,45,...,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN
119037,82506,1945-12-29,0,NaN,28.333333,18.333333,23.333333,0,1,45,...,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN
119038,82506,1945-12-30,0,NaN,28.333333,18.333333,23.333333,0,NaN,45,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119039,82506,1945-12-31,0,NaN,29.444444,17.222222,23.333333,0,NaN,45,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
stations_clean.to_csv('Resources/weather_stations.csv')

In [12]:
import sqlite3
from sqlite3 import Error

import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, inspect

# Import Flask 
# from flask import Flask, jsonify

# Setup Database
engine = create_engine('sqlite:///wwii.db')

stations_clean.to_sql('weather_stations', con=engine)